## Pandas

In [1]:
import pandas as pd
pd.__version__

'1.4.4'

### Creating Example Data Frame

In [2]:
#way1 
df = pd.DataFrame({'name':['Arjun','Nakul'], 'age':[30, 20]})
df

    name  age
0  Arjun   30
1  Nakul   20

In [3]:
#for larger dataframe use numpy 

import numpy as np
pd.DataFrame(np.random.randn(4,8))

,0,1,2,3,4,5,6,7
0,1.747855,-0.700912,0.020346,1.558285,-0.834884,-0.481627,-0.346287,-1.050106
1,-0.043994,1.057017,-1.497384,0.116107,0.015264,-0.976520,-0.798251,-1.388520
2,-0.152540,-0.110774,0.320410,-1.254721,-0.986263,0.317829,1.336919,-0.405586
3,-0.400024,1.032625,-0.078475,-0.624640,1.078328,0.333185,2.355212,0.816790

In [4]:
# giving non numeric columns names 

pd.DataFrame(np.random.randn(4,8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.285157,0.452337,0.234359,1.258765,0.426289,0.877209,-0.659563,-1.329958
1,0.041826,0.756005,-0.021892,-0.155887,0.006887,-0.024045,-1.557109,-1.531705
2,-1.447765,1.039642,0.391431,-1.509464,0.607915,1.386085,-0.486692,0.439194
3,-0.240612,-0.973784,1.661182,0.453806,0.980746,0.055928,-2.166795,-0.852946

### Rename columns

In [5]:
df = pd.DataFrame({'col 1' :['ram', 'lakshman'], 'col 2':[34 ,25]})
df

      col 1  col 2
0       ram     34
1  lakshman     25

In [6]:
df = df.rename({'col 1':'col_1', 'col 2' : 'col_2'}, axis= 'columns')
df

      col_1  col_2
0       ram     34
1  lakshman     25

In [7]:
df.columns = ['col 1','col 2']

In [8]:
df

      col 1  col 2
0       ram     34
1  lakshman     25

In [9]:
df.columns = df.columns.str.replace(' ', '_')
df

      col_1  col_2
0       ram     34
1  lakshman     25

In [10]:
 # to add prefix in column names
df.add_prefix('X_')

    X_col_1  X_col_2
0       ram       34
1  lakshman       25

In [11]:
# to add sufix in column names
df.add_suffix('_Y')

    col_1_Y  col_2_Y
0       ram       34
1  lakshman       25

### Reading data from csv

In [12]:
#loading data in pandas
df = pd.read_csv('data/pokemon_data.csv')
df.head(5)

,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

### Build a dataframe from multiple files(row wise)

In [13]:
from glob import glob
transactions_files= sorted(glob('data/transactions*.csv'))
transactions_files

['data/transactions1.csv', 'data/transactions2.csv', 'data/transactions3.csv']

In [14]:
pd.concat((pd.read_csv(file) for file in transactions_files), ignore_index=True)

   transaction_id  customer_id product  price
0             100            1    ball     30
1             101            2     bat    100
2             102            2  gloves     50
3             200            3     bat    250
4             201            3   shirt    120
5             202            4  gloves     20
6             300            4   shoes    300
7             301            5    ball     50
8             302            5    pads    100

### Build dataframe from multiple files (column wise)

In [15]:
customers_files = sorted(glob('data/customers*.csv'))
customers_files

['data/customers1.csv', 'data/customers2.csv']

In [16]:
pd.concat((pd.read_csv(file) for file in customers_files), axis='columns').head()

   customer_id   name     city   country  population
0            1  Arjun    delhi     India     1000000
1            2  Angad   meerut  Srilanka      200000
2            3  Karan  panipat    Bhutan       30000

In [17]:
# read the headers
df.columns

Index(['Name', 'Type 1', 'Type 2', 'HP', 'Attack', 'Defense', 'Sp. Atk',
       'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [18]:
# read each column
df[['Name', 'Attack']].head()

                    Name  Attack
0              Bulbasaur      49
1                Ivysaur      62
2               Venusaur      82
3  VenusaurMega Venusaur     100
4             Charmander      52

In [19]:
# print each row
df.iloc[1]

Name          Ivysaur
Type 1          Grass
Type 2         Poison
HP                 60
Attack             62
Defense            63
Sp. Atk            80
Sp. Def            80
Speed              60
Generation          1
Legendary       False
Name: 1, dtype: object

In [20]:
df.iloc[1:4]

,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
1,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False

In [21]:
# read specific location
df.iloc[2,1]

'Grass'

In [22]:
# to go row by row in dataframe
# for index, row in df.iterrows():
#     print(index, row['Name'])

In [23]:
#also working with conditional statement use loc

df.loc[df['Type 1']=="Fire"].head()

,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
5,Charmeleon,Fire,NaN,58,64,58,80,65,80,1,False
6,Charizard,Fire,Flying,78,84,78,109,85,100,1,False
7,CharizardMega Charizard X,Fire,Dragon,78,130,111,130,85,100,1,False
8,CharizardMega Charizard Y,Fire,Flying,78,104,78,159,115,100,1,False

In [24]:
df.describe()

,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

In [25]:
df.describe().loc['min':'max', 'Attack':'Speed']

     Attack  Defense  Sp. Atk  Sp. Def  Speed
min     5.0      5.0    10.00     20.0    5.0
25%    55.0     50.0    49.75     50.0   45.0
50%    75.0     70.0    65.00     70.0   65.0
75%   100.0     90.0    95.00     90.0   90.0
max   190.0    230.0   194.00    230.0  180.0

### reverse row order

In [26]:
df.loc[::-1].head()

,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
799,Volcanion,Fire,Water,80,110,120,130,90,70,6,True
798,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
797,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
796,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
795,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True

In [27]:
#reverse and reset index
df.loc[::-1].reset_index(drop=True).head()

,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,Volcanion,Fire,Water,80,110,120,130,90,70,6,True
1,HoopaHoopa Unbound,Psychic,Dark,80,160,60,170,130,80,6,True
2,HoopaHoopa Confined,Psychic,Ghost,80,110,60,150,130,70,6,True
3,DiancieMega Diancie,Rock,Fairy,50,160,110,160,110,110,6,True
4,Diancie,Rock,Fairy,50,100,150,100,150,50,6,True

### reverse column order

In [28]:
df.loc[:, ::-1].head()

,Legendary,Generation,Speed,Sp. Def,Sp. Atk,Defense,Attack,HP,Type 2,Type 1,Name
0,False,1,45,65,65,49,49,45,Poison,Grass,Bulbasaur
1,False,1,60,80,80,63,62,60,Poison,Grass,Ivysaur
2,False,1,80,100,100,83,82,80,Poison,Grass,Venusaur
3,False,1,80,120,122,123,100,80,Poison,Grass,VenusaurMega Venusaur
4,False,1,65,50,60,43,52,39,NaN,Fire,Charmander

### select columns by datatype

In [29]:
df.dtypes

Name          object
Type 1        object
Type 2        object
HP             int64
Attack         int64
Defense        int64
Sp. Atk        int64
Sp. Def        int64
Speed          int64
Generation     int64
Legendary       bool
dtype: object

In [30]:
df.select_dtypes(include='number').head()

   HP  Attack  Defense  Sp. Atk  Sp. Def  Speed  Generation
0  45      49       49       65       65     45           1
1  60      62       63       80       80     60           1
2  80      82       83      100      100     80           1
3  80     100      123      122      120     80           1
4  39      52       43       60       50     65           1

In [31]:
df.select_dtypes(include='object').head()

                    Name Type 1  Type 2
0              Bulbasaur  Grass  Poison
1                Ivysaur  Grass  Poison
2               Venusaur  Grass  Poison
3  VenusaurMega Venusaur  Grass  Poison
4             Charmander   Fire     NaN

In [32]:
df.select_dtypes(exclude='number').head()

                    Name Type 1  Type 2  Legendary
0              Bulbasaur  Grass  Poison      False
1                Ivysaur  Grass  Poison      False
2               Venusaur  Grass  Poison      False
3  VenusaurMega Venusaur  Grass  Poison      False
4             Charmander   Fire     NaN      False

### convert string to numbers

In [33]:
df = pd.DataFrame({'col_one':['1.1', '1.3', '3.3'],
                   'col_two':['4.4', '5.3', '7.5'],
                   'col_three':['3.1', '6.3', '-']})

df

  col_one col_two col_three
0     1.1     4.4       3.1
1     1.3     5.3       6.3
2     3.3     7.5         -

In [34]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [35]:
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

> it didn't convert the third column...for that we will use `pd.to_numeric` method.

In [36]:
pd.to_numeric(df.col_three, errors='coerce')

0    3.1
1    6.3
2    NaN
Name: col_three, dtype: float64

In [37]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    3.1
1    6.3
2    0.0
Name: col_three, dtype: float64

In [38]:
#you can use above method on complete dataframe using apply

df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        3.1
1      1.3      5.3        6.3
2      3.3      7.5        0.0

In [39]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

### reduce dataframe size  

* using usecols to read only required columns in memory  
* convert any column containing categorical data into category type

In [40]:
 
df = pd.read_csv('data/pokemon_data.csv')
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        800 non-null    object
 1   Type 1      800 non-null    object
 2   Type 2      414 non-null    object
 3   HP          800 non-null    int64
 4   Attack      800 non-null    int64
 5   Defense     800 non-null    int64
 6   Sp. Atk     800 non-null    int64
 7   Sp. Def     800 non-null    int64
 8   Speed       800 non-null    int64
 9   Generation  800 non-null    int64
 10  Legendary   800 non-null    bool
dtypes: bool(1), int64(7), object(3)
memory usage: 182.2 KB

In [41]:
# using usecols to read only required columns in memory
cols = ['Name', 'Type 2', 'Type 1','HP']
df = pd.read_csv('data/pokemon_data.csv', usecols=cols)
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    800 non-null    object
 1   Type 1  800 non-null    object
 2   Type 2  414 non-null    object
 3   HP      800 non-null    int64
dtypes: int64(1), object(3)
memory usage: 143.9 KB

In [42]:
#convert any column containing categorical data into category type
cols = ['Name', 'Type 2', 'Type 1','HP']
dtypes={'Name':'category', 'Type 2':'category', 'Type 1': 'category'}
df = pd.read_csv('data/pokemon_data.csv', usecols=cols, dtype=dtypes)
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    800 non-null    category
 1   Type 1  800 non-null    category
 2   Type 2  414 non-null    category
 3   HP      800 non-null    int64
dtypes: category(3), int64(1)
memory usage: 96.5 KB

In [43]:
#sorting values by name in reverse manner
df.sort_values('Name', ascending=False)

                        Name   Type 1  Type 2   HP
794         Zygarde50% Forme   Dragon  Ground  108
695                 Zweilous     Dark  Dragon   72
46                     Zubat   Poison  Flying   40
631                    Zorua     Dark     NaN   40
632                  Zoroark     Dark     NaN   60
..                       ...      ...     ...  ...
393          AbsolMega Absol     Dark     NaN   65
392                    Absol     Dark     NaN   65
68                      Abra  Psychic     NaN   25
511  AbomasnowMega Abomasnow    Grass     Ice   90
510                Abomasnow    Grass     Ice   90

[800 rows x 4 columns]

In [44]:
#sorting based on multiple values
df.sort_values(['Type 1', 'HP'], ascending=[1,0])

                        Name Type 1    Type 2  HP
520                  Yanmega    Bug    Flying  86
698                Volcarona    Bug      Fire  85
231                Heracross    Bug  Fighting  80
232  HeracrossMega Heracross    Bug  Fighting  80
678                 Accelgor    Bug       NaN  80
..                       ...    ...       ...  ..
106                   Krabby  Water       NaN  30
125                   Horsea  Water       NaN  30
129                   Staryu  Water       NaN  30
139                 Magikarp  Water       NaN  20
381                   Feebas  Water       NaN  20

[800 rows x 4 columns]

### making changes to data

In [46]:
#adding columns
df = pd.read_csv('data/pokemon_data.csv')
df['Total']=df['HP']+df['Attack']+df['Defense']+df['Sp. Atk']+df['Sp. Def']+df['Speed']
df.head()

,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Total
0,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False,318
1,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False,405
2,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False,525
3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False,625
4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False,309

In [ ]:
df.drop(columns =['Total'], inplace=True)
df.head()

In [ ]:
df['Total'] = df.iloc[:,4:10].sum(axis=1)
df.head()

In [ ]:
#lets bring total before hp
cols=list(df.columns.values)
df = df[cols[0:4] + [cols[-1]] + cols[4:12]]

df.head()

### Filtering

In [ ]:
df = pd.read_csv('data/pokemon_data.csv')
df.loc[df['Type 1']=='Grass']

In [ ]:
df['Type 1'].unique()

In [ ]:
#multiple condition on same columns
df[(df['Type 1'] == 'Fire') |
   (df['Type 1'] == 'Bug') |
   (df['Type 1'] == 'Steel')]

In [ ]:
# better way for multiple condition on same columns
df[df['Type 1'].isin(['Fire', 'Bug', 'Steel'])]

In [ ]:
# filter a dataframe by largest catgeries (ex:-top 3)
counts = df['Type 1'].value_counts()
counts.nlargest(3)

In [ ]:
counts.nlargest(3).index

In [ ]:
df[df['Type 1'].isin(counts.nlargest(3).index)]

In [ ]:
#multiple condition on different columns
df.loc[(df['Type 1']=='Grass') & (df['Type 2']=='Poison')]

In [ ]:
df.loc[(df['Type 1']=='Grass')  | (df['Type 2']=='Poison')]

In [ ]:
#regex filtering

df.loc[df['Name'].str.contains('Mega')]

In [ ]:
#not mega
df.loc[~df['Name'].str.contains('Mega')]

In [ ]:
import re


df.loc[df['Type 1'].str.contains('Fire|Grass', regex=True)]

In [ ]:
df.loc[df['Type 1'].str.contains('Fire|Grass',flags=re.I ,regex=True)]

In [ ]:
# starting with pi
df.loc[df['Name'].str.contains('^pi[a-z]*',flags=re.I ,regex=True)]

### conditional changes

In [ ]:
df.loc[df['Type 1']=='Fire', 'Type 1'] ='Flamer'
df.head()

In [ ]:
df.loc[df['Type 1']=='Fire', 'Legendary'] ='True'
df

In [ ]:
# update multiple columns based on conditions
df.loc[df['Total']>500, ['Generation', 'Legendary']]=['Test 1', 'Test 2']
df

In [ ]:
# reset things and load data again

df = pd.read_csv('data/pokemon_data.csv')

### Aggregate Statistics

In [ ]:
df = pd.read_csv('data/pokemon_data.csv')
df.groupby(['Type 1']).mean().sort_values('Defense', ascending=False)

In [ ]:
df['count']=1
df.groupby(['Type 1']).count()['count']

In [ ]:
df.groupby(['Type 1', 'Type 2']).count()['count']

In [ ]:
## aggregate by multiple functions

df.groupby('Type 1').Attack.agg(['sum','count']).reset_index()

In [ ]:
# combine the output of an aggregation with dataframe
df = pd.read_csv('data/pokemon_data.csv')
total_attack= df.groupby('Type 1').Attack.transform('sum')
df['total_attack']= total_attack
df

In [ ]:
df.groupby(['Type 1', 'Type 2']).Generation.mean().unstack()

### Create pivot table

In [ ]:
df.pivot_table(index='Type 1', columns='Type 2', values='Generation', aggfunc='mean')

In [ ]:
# to add overall at end
df.pivot_table(index='Type 1', columns='Type 2', values='Generation', aggfunc='mean', margins=True)

In [ ]:
df.pivot_table(index='Type 1', columns='Type 2', values='Generation', aggfunc='count', margins=True)

### working with large dataset

In [ ]:
new_df = pd.DataFrame(columns=df.columns)
for df in pd.read_csv('data/pokemon_data.csv', chunksize=5):
    results = df.groupby(['Type 1']).count()
    
    new_df = pd.concat([new_df, results])

### Handling Missing values

In [ ]:
df = pd.read_csv('data/pokemon_data.csv')
df.head()

In [ ]:
df.isna().sum()

In [ ]:
#  missing values in percent
df.isna().mean()*100

In [ ]:
df.dropna(axis='columns').head()

In [ ]:
# droping columns having more than 10% of missing values
df.dropna(thresh=len(df)*0.9, axis='columns').head()

### split a string into multiple columns

In [ ]:
df = pd.DataFrame({'name':['Mark Taylor', 'Sachin Ramesh Tendulkar'],
                   'location':['Los Angeles, CA', 'Washington, DC']})
df

In [ ]:
df.name.str.split(' ', expand=True)

In [ ]:
df[['first', 'middle', 'last']]=df.name.str.split(' ', expand=True)
df

In [ ]:
df.location.str.split(',', expand=True)

In [ ]:
df['city']= df.location.str.split(',', expand=True)[0]
df

### Expand a Series of lists into a DataFrame

In [ ]:
df = pd.DataFrame({'col_one':['a', 'b', 'c'], 'col_two':[[10,40], [20, 50], [30,60]]})
df

In [ ]:
df_new = df.col_two.apply(pd.Series)
df_new

In [ ]:
pd.concat([df, df_new], axis='columns')

### Convert continuos data to categorical data

In [ ]:
df=pd.read_csv('data/pokemon_data.csv')
pd.cut(df.Attack, bins=[5,50, 100, 150,200],labels=['very low', 'low','medium', 'high']).head(10)